In [ ]:
import pandas as pd
import glob
import os

csv_files = glob.glob('*.csv')
for file in csv_files:
    df_file = pd.read(file, low_memory = False)
    if len(df_file) == 1:
        os.remove(file)

In [2]:
df = pd.read_clipboard()
df

   CustomerId  Age
0           1   25
1           2   18
2           3   45
3           4   57
4           5   34

In [3]:
Price = [123,345,1212,11,677]

In [6]:
import pandas as pd
df = pd.read_clipboard()
Price = [123,345,1212,11,677]
df.loc[:,'Price'] = Price
df

   CustomerId  Age  Price
0           1   25    123
1           2   18    345
2           3   45   1212
3           4   57     11
4           5   34    677